In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("placement.csv")
df

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [3]:
df.head()

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1
4  7.52          7.30       1

In [4]:
df.tail()

    cgpa  resume_score  placed
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

In [5]:
df.describe()

           cgpa  resume_score      placed
count  100.0000    100.000000  100.000000
mean     6.9422      6.930500    0.500000
std      1.1192      0.979608    0.502519
min      5.2700      4.950000    0.000000
25%      5.9800      6.190000    0.000000
50%      6.6200      7.055000    0.500000
75%      8.0450      7.640000    1.000000
max      9.4000      9.060000    1.000000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cgpa          100 non-null    float64
 1   resume_score  100 non-null    float64
 2   placed        100 non-null    int64
dtypes: float64(2), int64(1)
memory usage: 2.5 KB

In [8]:
top_left_corner_df = df.iloc[:4, :2]
top_left_corner_df

   cgpa  resume_score
0  8.14          6.52
1  6.17          5.17
2  8.27          8.86
3  6.88          7.27

In [10]:
df.loc[0:3, ["cgpa", "resume_score"]]

   cgpa  resume_score
0  8.14          6.52
1  6.17          5.17
2  8.27          8.86
3  6.88          7.27

In [22]:
# check the range index and columns name
df.axes

[RangeIndex(start=0, stop=100, step=1),
 Index(['cgpa', 'resume_score', 'placed'], dtype='object')]

In [21]:
# for the check type of columns
df.dtypes

cgpa            float64
resume_score    float64
placed            int64
dtype: object

In [14]:
# it return True if there is any missing(NULL) data in dataframe otherwise False
df.empty

False

In [20]:
# find the missing value(NULL), it return True if there is any missing(NULL) data in dataframe otherwise False
df.isnull()

     cgpa  resume_score  placed
0   False         False   False
1   False         False   False
2   False         False   False
3   False         False   False
4   False         False   False
..    ...           ...     ...
95  False         False   False
96  False         False   False
97  False         False   False
98  False         False   False
99  False         False   False

[100 rows x 3 columns]

In [19]:
# find the total sum of missing value
df.isnull().sum()

cgpa            0
resume_score    0
placed          0
dtype: int64

In [18]:
# For drop the missing value row
df.dropna()

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [23]:
df.ndim

2

In [24]:
df.shape

(100, 3)

In [25]:
df.size

300

In [26]:
df.values

array([[8.14, 6.52, 1.  ],
       [6.17, 5.17, 0.  ],
       [8.27, 8.86, 1.  ],
       [6.88, 7.27, 1.  ],
       [7.52, 7.3 , 1.  ],
       [8.77, 6.19, 1.  ],
       [5.34, 7.09, 0.  ],
       [6.56, 6.29, 0.  ],
       [6.32, 6.71, 0.  ],
       [7.69, 7.12, 1.  ],
       [6.18, 6.35, 0.  ],
       [5.44, 6.54, 0.  ],
       [6.09, 7.01, 0.  ],
       [8.5 , 5.09, 1.  ],
       [7.51, 6.25, 1.  ],
       [8.88, 5.93, 1.  ],
       [8.04, 7.64, 1.  ],
       [7.81, 8.71, 1.  ],
       [5.94, 5.88, 0.  ],
       [6.75, 8.11, 1.  ],
       [5.8 , 8.06, 0.  ],
       [6.53, 7.64, 0.  ],
       [6.16, 5.77, 0.  ],
       [6.05, 7.13, 0.  ],
       [8.22, 6.18, 1.  ],
       [7.76, 5.68, 1.  ],
       [6.27, 6.47, 0.  ],
       [5.51, 6.15, 0.  ],
       [7.46, 7.67, 1.  ],
       [6.19, 7.3 , 0.  ],
       [7.36, 7.15, 1.  ],
       [5.92, 7.02, 0.  ],
       [5.87, 7.96, 0.  ],
       [8.43, 7.73, 1.  ],
       [8.87, 7.19, 1.  ],
       [8.07, 7.48, 1.  ],
       [8.16, 7.56, 1.  ],
       [9.05, 8.21, 1.  ],
       [6.  , 8.72, 0.  ],
       [7.5 , 6.19, 1.  ],
       [8.25, 5.32, 1.  ],
       [8.68, 5.15, 1.  ],
       [6.9 , 6.91, 1.  ],
       [8.21, 7.95, 1.  ],
       [5.47, 5.92, 0.  ],
       [8.1 , 5.44, 1.  ],
       [5.83, 5.21, 0.  ],
       [7.05, 8.14, 1.  ],
       [5.54, 6.57, 0.  ],
       [5.46, 6.73, 0.  ],
       [8.22, 6.74, 1.  ],
       [6.54, 7.39, 0.  ],
       [5.9 , 7.5 , 0.  ],
       [6.  , 7.16, 0.  ],
       [5.92, 7.18, 0.  ],
       [6.94, 6.87, 1.  ],
       [6.13, 6.43, 0.  ],
       [6.34, 7.21, 0.  ],
       [6.47, 7.37, 0.  ],
       [5.95, 7.57, 0.  ],
       [5.87, 6.64, 0.  ],
       [6.89, 7.96, 1.  ],
       [5.75, 8.43, 0.  ],
       [8.65, 7.58, 1.  ],
       [7.93, 8.09, 1.  ],
       [6.04, 8.75, 0.  ],
       [8.35, 8.02, 1.  ],
       [6.59, 6.81, 1.  ],
       [6.01, 7.49, 0.  ],
       [8.06, 9.06, 1.  ],
       [7.12, 7.41, 1.  ],
       [7.34, 8.22, 1.  ],
       [7.63, 7.98, 1.  ],
       [5.76, 6.48, 0.  ],
       [5.54, 7.36, 0.  ],
       [6.34, 7.94, 1.  ],
       [9.4 , 5.5 , 1.  ],
       [5.88, 6.92, 0.  ],
       [5.79, 5.66, 0.  ],
       [5.27, 7.28, 0.  ],
       [7.83, 7.7 , 1.  ],
       [6.12, 6.72, 0.  ],
       [7.92, 6.06, 1.  ],
       [7.6 , 8.08, 1.  ],
       [5.76, 6.49, 0.  ],
       [6.72, 5.46, 0.  ],
       [6.18, 5.76, 0.  ],
       [5.62, 5.05, 0.  ],
       [8.07, 6.07, 1.  ],
       [5.99, 7.49, 0.  ],
       [5.85, 5.56, 0.  ],
       [8.28, 6.3 , 1.  ],
       [5.43, 6.18, 0.  ],
       [9.31, 7.39, 1.  ],
       [8.01, 4.95, 1.  ],
       [6.33, 6.38, 0.  ],
       [8.23, 7.76, 1.  ],
       [6.65, 7.78, 0.  ],
       [8.14, 5.63, 1.  ],
       [6.09, 6.61, 0.  ]])

In [27]:
df_copy = df.copy()
df_copy

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [29]:
sorted_df = df.sort_values(by = "resume_score")
sorted_df

    cgpa  resume_score  placed
94  8.01          4.95       1
87  5.62          5.05       0
13  8.50          5.09       1
41  8.68          5.15       1
1   6.17          5.17       0
..   ...           ...     ...
17  7.81          8.71       1
38  6.00          8.72       0
65  6.04          8.75       0
2   8.27          8.86       1
69  8.06          9.06       1

[100 rows x 3 columns]

In [30]:
df["new_cgpa"] = df["cgpa"].astype(int)
df

    cgpa  resume_score  placed  new_cgpa
0   8.14          6.52       1         8
1   6.17          5.17       0         6
2   8.27          8.86       1         8
3   6.88          7.27       1         6
4   7.52          7.30       1         7
..   ...           ...     ...       ...
95  6.33          6.38       0         6
96  8.23          7.76       1         8
97  6.65          7.78       0         6
98  8.14          5.63       1         8
99  6.09          6.61       0         6

[100 rows x 4 columns]

In [31]:
df = df.drop(columns = ["new_cgpa"])
df

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [32]:
new_df = df

In [33]:
new_df["cgpa"] = new_df["cgpa"].astype(int)
new_df

    cgpa  resume_score  placed
0      8          6.52       1
1      6          5.17       0
2      8          8.86       1
3      6          7.27       1
4      7          7.30       1
..   ...           ...     ...
95     6          6.38       0
96     8          7.76       1
97     6          7.78       0
98     8          5.63       1
99     6          6.61       0

[100 rows x 3 columns]

In [34]:
df

    cgpa  resume_score  placed
0      8          6.52       1
1      6          5.17       0
2      8          8.86       1
3      6          7.27       1
4      7          7.30       1
..   ...           ...     ...
95     6          6.38       0
96     8          7.76       1
97     6          7.78       0
98     8          5.63       1
99     6          6.61       0

[100 rows x 3 columns]

In [35]:
copy_df = df.copy()
copy_df

    cgpa  resume_score  placed
0      8          6.52       1
1      6          5.17       0
2      8          8.86       1
3      6          7.27       1
4      7          7.30       1
..   ...           ...     ...
95     6          6.38       0
96     8          7.76       1
97     6          7.78       0
98     8          5.63       1
99     6          6.61       0

[100 rows x 3 columns]

In [36]:
copy_df["cgpa"] = copy_df["cgpa"].astype(float)
copy_df

    cgpa  resume_score  placed
0    8.0          6.52       1
1    6.0          5.17       0
2    8.0          8.86       1
3    6.0          7.27       1
4    7.0          7.30       1
..   ...           ...     ...
95   6.0          6.38       0
96   8.0          7.76       1
97   6.0          7.78       0
98   8.0          5.63       1
99   6.0          6.61       0

[100 rows x 3 columns]

In [37]:
df

    cgpa  resume_score  placed
0      8          6.52       1
1      6          5.17       0
2      8          8.86       1
3      6          7.27       1
4      7          7.30       1
..   ...           ...     ...
95     6          6.38       0
96     8          7.76       1
97     6          7.78       0
98     8          5.63       1
99     6          6.61       0

[100 rows x 3 columns]

In [39]:
df["cgpa"] = df["cgpa"].add(4)
df

    cgpa  resume_score  placed
0     12          6.52       1
1     10          5.17       0
2     12          8.86       1
3     10          7.27       1
4     11          7.30       1
..   ...           ...     ...
95    10          6.38       0
96    12          7.76       1
97    10          7.78       0
98    12          5.63       1
99    10          6.61       0

[100 rows x 3 columns]

In [40]:
df.count()

cgpa            100
resume_score    100
placed          100
dtype: int64

In [41]:
df.max()

cgpa            13.00
resume_score     9.06
placed           1.00
dtype: float64

In [42]:
df.min()

cgpa            9.00
resume_score    4.95
placed          0.00
dtype: float64

In [43]:
df.mean()

cgpa            10.4700
resume_score     6.9305
placed           0.5000
dtype: float64

In [44]:
df["cgpa"].mean()

10.47

In [45]:
df.median()

cgpa            10.000
resume_score     7.055
placed           0.500
dtype: float64

In [46]:
df["cgpa"].median()

10.0

In [47]:
filter_df = df.filter(items = ["cgpa", "placed"])
filter_df

    cgpa  placed
0     12       1
1     10       0
2     12       1
3     10       1
4     11       1
..   ...     ...
95    10       0
96    12       1
97    10       0
98    12       1
99    10       0

[100 rows x 2 columns]

In [49]:
df[["cgpa","resume_score"]]

    cgpa  resume_score
0     12          6.52
1     10          5.17
2     12          8.86
3     10          7.27
4     11          7.30
..   ...           ...
95    10          6.38
96    12          7.76
97    10          7.78
98    12          5.63
99    10          6.61

[100 rows x 2 columns]

In [50]:
# axis = 0, means row
df.filter(items = [3,4,2,5,6,2], axis = 0)

   cgpa  resume_score  placed
3    10          7.27       1
4    11          7.30       1
2    12          8.86       1
5    12          6.19       1
6     9          7.09       0

In [51]:
new_df = df.rename(columns = {"cgpa" : "updated_cgpa", "resume_score" : "updated_score"})
new_df

    updated_cgpa  updated_score  placed
0             12           6.52       1
1             10           5.17       0
2             12           8.86       1
3             10           7.27       1
4             11           7.30       1
..           ...            ...     ...
95            10           6.38       0
96            12           7.76       1
97            10           7.78       0
98            12           5.63       1
99            10           6.61       0

[100 rows x 3 columns]

In [52]:
df

    cgpa  resume_score  placed
0     12          6.52       1
1     10          5.17       0
2     12          8.86       1
3     10          7.27       1
4     11          7.30       1
..   ...           ...     ...
95    10          6.38       0
96    12          7.76       1
97    10          7.78       0
98    12          5.63       1
99    10          6.61       0

[100 rows x 3 columns]

In [54]:
df["half"] = df["cgpa"].where(df["cgpa"]>7, other=0)
df

    cgpa  resume_score  placed  half
0     12          6.52       1    12
1     10          5.17       0    10
2     12          8.86       1    12
3     10          7.27       1    10
4     11          7.30       1    11
..   ...           ...     ...   ...
95    10          6.38       0    10
96    12          7.76       1    12
97    10          7.78       0    10
98    12          5.63       1    12
99    10          6.61       0    10

[100 rows x 4 columns]